In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import re

# Data Description

* Population
* GDP
* DCT - $CO_{2}$ Emissions – Total - `CDI = CO2 Intensity Current-Year Score`
* DPT - $CO_{2}$ emissions/kWh elect. & heat - `CEH = CO2 Emissions per kWh`
* DMT - $CH_{4}$ emissions - `CHI = $CH_{4}$ Intensity Current-Year Score`
* DNT - $N_{2}O$ emissions - `NOI = $N_{2}O$ Intensity Current-Year Score`
* DBT - Black Carbon emissions - `BCI = Black Carbon Current-Year Score`

In [11]:
pop = pd.read_excel('pop_corr.xlsx')
gdp = pd.read_excel('gdp_corr.xlsx')
dpt = pd.read_excel('dpt_corr.xlsx')
dnt = pd.read_excel('dnt_corr.xlsx')
dbt = pd.read_excel('dbt_corr.xlsx')
dct = pd.read_excel('dct_corr.xlsx')

# Join all Dataframes

In [20]:
join1 = pd.merge(pop,gdp) # pop + gdp
join1

      Unnamed: 0                    country  year  population           GPD
0              0                Afghanistan  1997  18381605.0           NaN
1              1                    Albania  1997   3148281.0  1.280324e+10
2              2                    Algeria  1997  29886839.0  2.827615e+11
3              3             American Samoa  1997     54941.0  2.054374e+11
4              4                    Andorra  1997     64327.0  1.281133e+11
...          ...                        ...   ...         ...           ...
4243        4243  Wallis and Futuna Islands  2014  69234709.0  3.577771e+11
4244        4244             Western Sahara  2014  47740518.0  2.283210e+11
4245        4245                      Yemen  2014  26246327.0  9.886482e+10
4246        4246                     Zambia  2014  15620974.0  5.674325e+10
4247        4247                   Zimbabwe  2014  15411675.0  2.605736e+10

[4248 rows x 5 columns]

In [21]:
join2 = pd.merge(join1,dct) # pop + gdp + dct
join2

,Unnamed: 0,country,year,population,GPD,DCT
0,0,Afghanistan,1997,18381605.0,NaN,NaN
1,1,Albania,1997,3148281.0,1.280324e+10,-22.880046
2,2,Algeria,1997,29886839.0,2.827615e+11,-22.076274
3,3,American Samoa,1997,54941.0,2.054374e+11,-22.113039
4,4,Andorra,1997,64327.0,1.281133e+11,-22.149804
...,...,...,...,...,...,...
4243,4243,Wallis and Futuna Islands,2014,69234709.0,3.577771e+11,-21.875802
4244,4244,Western Sahara,2014,47740518.0,2.283210e+11,-22.001836
4245,4245,Yemen,2014,26246327.0,9.886482e+10,-22.127870
4246,4246,Zambia,2014,15620974.0,5.674325e+10,-23.306557
4247,4247,Zimbabwe,2014,15411675.0,2.605736e+10,-21.487182

In [9]:
#join3 = pd.merge(join2,dpt) # pop + gdp + dct + dpt
#join3

,Unnamed: 0,country,year,population,GPD,DCT,DPT
0,0,Afghanistan,1997,1.838160e+07,NaN,NaN,NaN
1,1,Albania,1997,3.148281e+06,1.280324e+10,-22.880046,NaN
2,2,Algeria,1997,2.988684e+07,2.827615e+11,-22.076274,NaN
3,3,American Samoa,1997,5.494100e+04,2.054374e+11,-22.113039,NaN
4,4,Andorra,1997,6.432700e+04,1.281133e+11,-22.149804,NaN
...,...,...,...,...,...,...,...
1883,1883,Wallis and Futuna Islands,2004,6.096329e+07,2.049864e+11,-21.960884,NaN
1884,1884,Western Sahara,2004,4.049018e+07,1.429934e+11,-22.077468,NaN
1885,1885,Yemen,2004,2.001707e+07,8.100046e+10,-22.194052,NaN
1886,1886,Zambia,2004,1.173175e+07,2.790162e+10,-23.289188,NaN
1887,1887,Zimbabwe,2004,1.277751e+07,2.277281e+10,-21.564498,NaN

In [22]:
join4 = pd.merge(join2,dnt) # pop + gdp + dct + dpt + dnt
join4

,Unnamed: 0,country,year,population,GPD,DCT,DNT
0,0,Afghanistan,1997,18381605.0,NaN,NaN,NaN
1,1,Albania,1997,3148281.0,1.280324e+10,-22.880046,-23.073170
2,2,Algeria,1997,29886839.0,2.827615e+11,-22.076274,-24.922934
3,3,American Samoa,1997,54941.0,2.054374e+11,-22.113039,-23.838001
4,4,Andorra,1997,64327.0,1.281133e+11,-22.149804,-22.753068
...,...,...,...,...,...,...,...
4243,4243,Wallis and Futuna Islands,2014,69234709.0,3.577771e+11,-21.875802,-23.782660
4244,4244,Western Sahara,2014,47740518.0,2.283210e+11,-22.001836,-23.849738
4245,4245,Yemen,2014,26246327.0,9.886482e+10,-22.127870,-23.916815
4246,4246,Zambia,2014,15620974.0,5.674325e+10,-23.306557,-20.959075
4247,4247,Zimbabwe,2014,15411675.0,2.605736e+10,-21.487182,-22.196837

In [23]:
join5 = pd.merge(join4,dbt) # pop + gdp + dct + dpt + dnt + dbt
join5

,Unnamed: 0,country,year,population,GPD,DCT,DNT,DBT
0,0,Afghanistan,1997,18381605.0,NaN,NaN,NaN,NaN
1,1,Albania,1997,3148281.0,1.280324e+10,-22.880046,-23.073170,-23.672880
2,2,Algeria,1997,29886839.0,2.827615e+11,-22.076274,-24.922934,-25.084849
3,3,American Samoa,1997,54941.0,2.054374e+11,-22.113039,-23.838001,-24.135877
4,4,Andorra,1997,64327.0,1.281133e+11,-22.149804,-22.753068,-23.186905
...,...,...,...,...,...,...,...,...
4243,4243,Wallis and Futuna Islands,2014,69234709.0,3.577771e+11,-21.875802,-23.782660,-21.113418
4244,4244,Western Sahara,2014,47740518.0,2.283210e+11,-22.001836,-23.849738,-21.113418
4245,4245,Yemen,2014,26246327.0,9.886482e+10,-22.127870,-23.916815,-21.113418
4246,4246,Zambia,2014,15620974.0,5.674325e+10,-23.306557,-20.959075,-21.113418
4247,4247,Zimbabwe,2014,15411675.0,2.605736e+10,-21.487182,-22.196837,-21.113418

In [24]:
final_data = join5.drop(columns=['Unnamed: 0'],axis=1)
final_data.head()

,country,year,population,GPD,DCT,DNT,DBT
0,Afghanistan,1997,18381605.0,NaN,NaN,NaN,NaN
1,Albania,1997,3148281.0,1.280324e+10,-22.880046,-23.073170,-23.672880
2,Algeria,1997,29886839.0,2.827615e+11,-22.076274,-24.922934,-25.084849
3,American Samoa,1997,54941.0,2.054374e+11,-22.113039,-23.838001,-24.135877
4,Andorra,1997,64327.0,1.281133e+11,-22.149804,-22.753068,-23.186905

In [25]:
final_data.shape

(4248, 7)

# Export to csv and excel

In [26]:
final_data.to_csv('data_clean.csv')
final_data.to_excel('data_clean.xlsx') # for Tableau

# SQL